import db
# company_name = ''
# model = ''
# price = 0
# description = ''''''
# db.add_product(company_name, model,price,description)
company_name = 'Samsung'
model = 'Galaxy S23 Ultra 12/256'
price = 110300
description = '''С новым Galaxy S23 Ultra каждый кадр – шедевр благодаря совершенно новому уровню четкости фото и видео в условиях слабой освещенности и невероятной детализации снимков на камеру 200МП. Самый мощный процессор в смартфоне Galaxy справится с задачами любой сложности: скорость – его стихия.'''
db.add_product(company_name, model,price,description)
company_name = 'Samsung'
model = 'Galaxy Z Flip4 8/256'
price = 69990
description = '''Смартфон, который складывается, как вы хотите
Устройство представлено палитрой из трендовых цветов, каждый из которых отразит вашу индивидуальность. Матовое стекло создает контраст с глянцевой металлической рамкой. Лавандовый, графитовый, золотой и голубой. Какой из цветов — ваш?
Смартфон обладает компактными размерами и уместится даже в самой маленькой сумке.
Galaxy Z Flip 4 обладает 6,7-дюймовым дисплеем и воспроизводит изображения высокого качества. Смартфон также отличается повышенной прочностью и выдерживает до 200 000 складываний.'''
db.add_product(company_name, model,price,description)
company_name = 'Samsung'
model = 'Galaxy S21 FE 6/128'
price = 44990
description = '''Для всех поклонников Galaxy, которые создают и выражают свою индивидуальность. Samsung Galaxy S21FE призван дать поклонникам по всему миру флагманские функции серии Galaxy S21. Стильный дизайн, который дополнит ваш образ. Возможности для занятий, которые вы так любите. Камера, чтобы запечатлеть все, что вас вдохновляет. Безупречная связь, которая делает все проще.'''
db.add_product(company_name, model,price,description)
company_name = 'Samsung'
model = 'Galaxy A52s 8/256 '
price = 26580
description = '''Samsung представила обновленный смартфон хитовой серии Galaxy A50. Им стал Galaxy A52s, который является легким переосмыслением модели первой половины этого года. Ключевые изменения - новый чипсет Snapdragon 778G, который сменил Snapdragon 750G, а также мятная расцветка пластикового корпуса, которая дополняет черную, белую и лиловую. Четверная камера с OIS на основном модуле, 120-Гц дисплей (у Galaxy A52 5G именно такой), аккумулятор на 4500 мАч с 25-Вт зарядкой, водозащита IP67 на месте.'''
db.add_product(company_name, model,price,description)
company_name = 'Samsung'
model = 'Galaxy Z Fold3 12/256'
price = 106070
description = '''Гибкие технологичные смартфоны продолжают занимать особое место в ряду флагманов Samsung. Представляем вам Galaxy Z Fold3 - самый большой имиджевый смартфон компании, который одним движением способен превращаться в полноценный планшет.'''
db.add_product(company_name, model,price,description)
company_name = 'Samsung'
model = 'Galaxy A73 5G 8/256'
price = 31450
description = '''Открывай новые возможности прямо сейчас. Мощный процессор Snapdragon 778G 5G выводит производительность на новый уровень, будь то ресурсоемкие игры, нейронные сети или съемка в условиях низкой освещенности. Функция RAM Plus открывает доступ к виртуальной оперативной памяти для безграничной работы в режиме многозадачности.
Насладись чётким и контрастным изображением на большом 6,7 дюймов FHD+ Super AMOLED Plus экране с яркостью до 800 нит даже при ярком дневном свете. Функция Eye Comfort Shield снижает уровень синего свечения, чтобы обеспечить твоим глазам комфорт в любых условиях.
Играй или листай, технология Super AMOLED Plus с частотой обновления экрана 120 Гц обеспечит яркий, насыщенный и сверхплавный просмотр любого контента.'''
db.add_product(company_name, model,price,description)


company_name = 'Xiaomi'
model = '12 8/128'
price = 40550
description = '''Xiaomi 12 – смартфон, который удобно держать одной рукой. В то же время гаджет предлагает невероятный уровень производительности благодаря новой аппаратной платформе Snapdragon 8 Gen 1. Обеспечивается длительное время автономной работы и эффективный контроль нагрева. За высокое качество фото- и видеосъемки отвечает тройная камера на 50 Мп.
Удобный размер корпуса и прекрасный дизайн'''
db.add_product(company_name, model,price,description)
company_name = 'Xiaomi'
model = 'Redmi Note 11 Pro 8/128'
price = 20290
description = '''Смартфон Xiaomi Redmi Note 11 Pro обладает системой камер флагманского уровня. Основная камера разрешением 108 Мп записывает 108 млн. деталей, обеспечивая кристальную четкость даже при многократном увеличении. Камеры Xiaomi Redmi Note 11 Pro позволяют получить превосходное качество изображений при съемке в темноте, в сверхширокоугольном режиме и режиме макросъемки.'''
db.add_product(company_name, model,price,description)
company_name = 'Xiaomi'
model = 'Redmi Note 10 Pro 8/256'
price = 18865
description = '''Новый уровень детализации
Основная камера с разрешением 108 Мп позволяет делать сверхчёткие снимки. Увеличьте фото, чтобы увидеть забавные
и неожиданные детали.
Смарт-дисплей, обеспечивающий идеальную яркость
Датчики внешней освещённости с общим углом обзора 360° автоматически регулируют яркость дисплея в зависимости от текущих условий.
Стереодинамики для отличного звучания'''
db.add_product(company_name, model,price,description)
company_name = 'Xiaomi'
model = 'Mi 11 Ultra 12/256'
price = 48990
description = '''Xiaomi Mi 11 Ultra — молниеносный смартфон класса Ультра. Здесь сверхмощная квадрокамера, изумительный HDR10+ дисплей и ультрабыстрый процессор. Модель получила влагозащиту IP68.
Второй экран — изюминка аппарата. Небольшой дисплей, прописавшийся в фотоблоке, может работать как видоискатель при съемке селфи на главную камеру. Еще он показывает уведомления, входящие вызовы, настраиваемые обои и анимации. С него можно принимать/отклонять звонки. Интересное техническое решение добавляет еще больше комфорта. Харизматичный Mi 11 Ultra — выбор того, кто не привык к компромиссам.'''
db.add_product(company_name, model,price,description)
company_name = 'Xiaomi'
model = 'Mi 10 Lite 6/128'
price = 21700
description = '''Невероятно быстрый гиперфлагманский процессор Qualcomm SDM765 Snapdragon 765G (7 nm) обеспечивает потрясающую производительность смартфона Xiaomi Mi 10 Lite. Дисплей с защитой Corning Gorilla Glass 5 — ультрачёткое изображение и долговечность. Сверхширокоугольная, защищенная сапфировым стеклом, камера с 4-мя объективами. Голографический закругленный стеклянный корпус с алюминиевой рамкой. Переливающиеся цвета и свет, попадающий на поверхность корпуса, вместе создают удивительный и изящный вид смартфона Mi 10 Lite.'''
db.add_product(company_name, model,price,description)
company_name = 'Xiaomi'
model = 'POCO X4 Pro 5G 8/256'
price = 27890
description = '''Готовьтесь к бесконечным развлечениям вместе со смартфоном Xiaomi Poco X4 Pro 5G. Благодаря узнаваемому классическому дизайну и эргономичной форме мобильный телефон настолько удобен, что его не хочется выпускать из рук. Дисплей диагональю 6,67 дюйма с разрешением 2400х1080 пикселей – качественное и насыщенное изображение с реалистичной цветопередачей. Модуль NFC для бесконтактной оплаты покупок. Операционная система Android 11. Встроенный модуль GPS, позволяющий не заблудиться в незнакомом городе или на природе. Поддержка Wi-Fi и Bluetooth для беспроводного подключения к интернету и гарнитуре. Со смартфоном Xiaomi Poco X4 Pro 5G каждая фотография становится настоящим шедевром. Основная камера позволяет одним нажатием кнопки проводить съемки кинематографического качества.'''
db.add_product(company_name, model,price,description)

company_name = 'Apple'
model = 'iPhone 14 128'
price = 64000
description = '''Тонкий и легкий смартфон из новой линейки Apple iPhone 14 с высоким разрешением OLED-экрана, хорошим объемом памяти и запасом автономности во влагостойком корпусе. Продвинутые камеры позволят снимать фото и видео в отличном качестве даже при слабом освещении. Функция экстренной помощи со связью через спутник выручит, когда нет возможности выйти в интернет. Мощный процессор откроет новые возможности для игр и развлечений.'''
db.add_product(company_name, model,price,description)
company_name = 'Apple'
model = 'iPhone 14 Pro Max 256'
price = 109890
description = '''Новый волшебный способ взаимодействия с iPhone.
Новаторские функции безопасности, призванные спасать жизни.
Инновационная 48-мегапиксельная камера для потрясающей детализации.
Все они оснащены новейшим чипом для смартфонов.
С керамическим экраном, более прочным, чем стекло любого смартфона. Водонепроницаемость. Нержавеющая сталь хирургического класса.
Представляем Dynamic Island, по-настоящему инновационную разработку Apple, состоящую из аппаратного и программного обеспечения. Он воспроизводит музыку, спортивные результаты, FaceTime и многое другое — и все это, не отвлекая вас от того, что вы делаете.'''
db.add_product(company_name, model,price,description)
company_name = 'Apple'
model = 'iPhone 11 64'
price = 35990
description = '''Функциональный и стильный смартфон Apple iPhone 11 в металлическом корпусе способен обеспечить не только повседневное общение и развлечения, но и продуктивную работу. Для этого он оснащен мощным процессором Apple A13 Bionic из 6 ядер, поддерживающим слаженную работу всех комплектующих, а также модулем ОЗУ объемом в 4 ГБ, что предусматривает быстрое переключение между открытыми приложениями и возможность играть в игры. Основная (12;12 Мп) и фронтальная (12 Мп) камеры позволят создавать фотошедевры. Изображение на экране смартфона Apple iPhone 11 диагональю 6.1 дюйма обладает поразительной детализацией и цветопередачей. Олеофобное покрытие исключает сильное загрязнение экрана. Корпус смартфона имеет высокую степень пылевлагозащиты (IP68), благодаря чему обеспечивается эффективная и длительная работа устройства. Несъемный аккумулятор емкостью 3110 мА·ч поддерживает беспроводную зарядку, что сделает данный процесс более легким и быстрым.'''
db.add_product(company_name, model,price,description)
company_name = 'Apple'
model = 'iPhone Xr 64'
price = 38450
description = '''iPhone XR оснащен самым передовым ЖК дисплеем iPhone-Liquid Retina 6,1 с потрясающими цветами. Инновационные технологии подсветки позволили создать экран, округленный по углам и занимающий всю переднюю панель. Процессор A12 Bionic с нейронной системой нового поколения использует технологии машинного обучения и предлагает невероятные возможности в области фотографии, игр, дополненной реальности и многое другое. Беспроводная зарядка поддерживает стандартные зарядные устройства Qi. Передовая технология Face ID позволяет быстро разблокировать устройство и подключиться к приложениям. Степень защиты корпуса от брызг, воды и пыли соответствует стандарту IP67 (глубина погружения до 1 метра составляет до 30 минут).'''
db.add_product(company_name, model,price,description)
company_name = 'Apple'
model = 'iPhone 12 Pro Max 128'
price = 85500
description = '''Apple iPhone 12 Pro Max — бескомпромиссный и престижный смартфон. Возможности гаджета восхищают. Ультрабыстрый процессор A14 Bionic заставляет игры «летать». Огромный дисплей Super Retina XDR привлекает «живой» картинкой. Система Pro-камер удивляет реалистичными видео Dolby Vision. Всеобщий ночной режим впечатляет качеством фотографий, снятых при недостатке света. Вернулся дизайн, полюбившийся миллионам фанатов бренда. Передовые характеристики сочетаются здесь с легендарной i-классикой. Монолитный корпус гаджета сделан из закаленного стекла и хирургической стали. Панель Ceramic Shield обеспечивает новый уровень защиты дисплея. Рамки уменьшились, а экран увеличился. Apple iPhone 12 Pro Max — выбор динамичных людей, следящих за развитием технологий.'''
db.add_product(company_name, model,price,description)
company_name = 'Apple'
model = 'iPhone 13 128'
price = 56500
description = '''Наша самая совершенная система двух камер.
Особый взгляд на прочность дисплея.
Чип, с которым всё супербыстро.
Аккумулятор держится заметно дольше.
iPhone 13 - сильный мира всего.
Мы разработали совершенно новую схему расположения и развернули объективы на 45 градусов. Благодаря этому внутри корпуса поместилась наша лучшая система двух камер с увеличенной матрицей широкоугольной камеры.
Кроме того, мы освободили место для системы оптической стабилизации изображения сдвигом матрицы. И повысили скорость работы матрицы на сверхширокоугольной камере.'''
db.add_product(company_name, model,price,description)